Terraform plan for __sandbox__
<details>
  <summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_router.router will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "ebo-sandbox-router"
      + network            = "ebo-sandbox-network"
      + project            = (known after apply)
      + region             = "asia-south1"
      + self_link          = (known after apply)
    }

  # google_compute_subnetwork.subnetwork will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.0.0.0/16"
      + name                       = "ebo-sandbox-subnetwork"
      + network                    = "ebo-sandbox-network"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + region                     = "asia-south1"
      + secondary_ip_range         = [
          + {
              + ip_cidr_range = "10.2.0.0/16"
              + range_name    = "cluster-pod-ip-range"
            },
          + {
              + ip_cidr_range = "10.1.0.0/20"
              + range_name    = "service-ip-range"
            },
        ]
      + self_link                  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

Plan generated in [Terraform #110](https://github.com/ebomart/commerce-infrastructure/actions/runs/1142967016)